Tekla Open API Reference for Tekla Structures 2025
PolycurveGeometryBuilder.Append Method (Arc)
 Appends an arc to the geometry list
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PolycurveGeometryBuilder Append(
	Arc arc
)
Public Function Append (
	arc As Arc
) As PolycurveGeometryBuilder
Parameters
arc
Type: Tekla.Structures.Geometry3d.Arc
Geometry to append
Return Value
Type: PolycurveGeometryBuilder
The builder itself
Exceptions
Exception | Condition
ArgumentException | Thrown if input geometry is not connected to the polycurve
See Also
Reference
PolycurveGeometryBuilder Class
Append Overload
Tekla.Structures.Geometry3d Namespace